Revit 2015 API
RoomTagTypeSet.Insert Method
Insert the specified room tag type into the set.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Insert(
	RoomTagType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As RoomTagType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	RoomTagType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Architecture.RoomTagType
The room tag type to be inserted into the set.
Return Value
Returns whether the room tag type was inserted into the set.
See Also
RoomTagTypeSet Class
Autodesk.Revit.DB.Architecture Namespace